RailsTeste/SISLETRON/app/controllers/alunos_controller.rb

  def index
    @alunos = Aluno.all
---
SELECT "alunos".* FROM "alunos"

  def show
    @aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos"  WHERE "alunos"."id" = ? LIMIT 1  [["id", 1]]