RailsTeste/SISLETRON/app/controllers/escolas_controller.rb

  def index
    @escolas = Escola.all
---
SELECT "escolas".* FROM "escolas"

  def show
    @escola = Escola.find(params[:id])
---
SELECT  "escolas".* FROM "escolas"  WHERE "escolas"."id" = ? LIMIT 1  [["id", 1]]