RailsTeste/SISLETRON/app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors"
---
  def index
    @professors = Professor.all

SELECT  "professors".* FROM "professors"  WHERE "professors"."id" = ? LIMIT 1  [["id", 1]]
SELECT "planos"."projeto_id" FROM "planos"  WHERE "planos"."professor_id" = 1
SELECT "projetos".* FROM "projetos"  WHERE "projetos"."id" IN (2)
SELECT "execucaos"."projeto_id" FROM "execucaos"  WHERE "execucaos"."professor_id" = 1
---
  def show
    @professor = Professor.find(params[:id])

    @turmas = @professor.turmas

    @plano = Plano.where(professor_id: @professor.id).pluck('projeto_id')
    @projetos_plano = Projeto.where(id: @plano)

    @execucao = Execucao.where(professor_id: @professor.id).pluck('projeto_id')