RailsTeste/SISLETRON/app/controllers/projetos_controller.rb

  def index
    @projetos = Projeto.all
---
SELECT "projetos".* FROM "projetos"

  def show
    @projeto = Projeto.find(params[:id])
    @turmas = @projeto.turmas
    @conteudos = @projeto.conteudos

    @execucao = Execucao.where(projeto_id: @projeto.id).pluck('professor_id')
    @professores_execucao = Professor.where(id: @execucao)

    @plano = Plano.where(projeto_id: @projeto.id).pluck('professor_id')
---
SELECT  "projetos".* FROM "projetos"  WHERE "projetos"."id" = ? LIMIT 1  [["id", 1]]
SELECT "execucaos"."professor_id" FROM "execucaos"  WHERE "execucaos"."projeto_id" = 2
SELECT  "execucaos".* FROM "execucaos"  WHERE "execucaos"."id" = ? LIMIT 1  [["id", 1]]
SELECT "professors".* FROM "professors"  WHERE "professors"."id" IN (SELECT "execucaos"."id" FROM "execucaos"  WHERE "execucaos"."projeto_id" = 1)
SELECT "planos"."professor_id" FROM "planos"  WHERE "planos"."projeto_id" = 1