RailsTeste/SISLETRON/app/controllers/turmas_controller.rb

SELECT "turmas".* FROM "turmas"
---
  def index
    @turmas = Turma.all

SELECT  "turmas".* FROM "turmas"  WHERE "turmas"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @turma = Turma.find(params[:id])